Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.Zones Property
 Gets or sets the spacing zones.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<RebarSpacingZone> Zones { get; set; }
Public Property Zones As List(Of RebarSpacingZone)
	Get
	Set
Property Value
Type: List<RebarSpacingZone>
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace